{
  "model_name": "radon",
  "model_type": "mistral",
  "hidden_size": 8192,
  "num_layers": 80,
  "num_attention_heads": 64,
  "num_kv_heads": 16,
  "intermediate_size": 22016,
  "vocab_size": 128000,
  "max_position_embeddings": 131072,
  "sliding_window": 16384,
  "rope_theta": 100000.0,
  "rms_norm_eps": 1e-6,
  "activation_function": "silu",
  "layer_norm_eps": 1e-6,
  "use_cache": true,
  "output_attentions": false,
  "output_hidden_states": false,
  "torch_dtype": "float16",
  "pad_token_id": 0,
  "eos_token_id": 2,
  "bos_token_id": 1,
  "unk_token_id": 3,
  "attention_dropout": 0.0,
  "hidden_dropout": 0.0,
  "initializer_range": 0.02,
  "use_flash_attention_2": true,
  "gradient_checkpointing": true,
  "tie_word_embeddings": false,
  "architectures": ["MistralForCausalLM"],
  "auto_map": {
    "AutoModelForCausalLM": "models.mistral_model.MistralForCausalLM"
  },
  "transformers_version": "4.36.0",
  "model_size": "70B",
  "parameters": 70000000000,
  "context_length": 131072,
  "languages": ["russian", "english", "code", "multilingual"],
  "optimizations": [
    "flash_attention_2",
    "gradient_checkpointing", 
    "fp16",
    "quantization_ready",
    "tensor_parallel",
    "pipeline_parallel",
    "expert_parallel"
  ],
  "performance": {
    "memory_efficient": true,
    "speed_optimized": true,
    "production_ready": true,
    "gpt5_competitor": true,
    "sota_capable": true
  },
  "creator": "MagistrTheOne",
  "description": "RADON GPT-5 Competitor: 70B parameter Mistral-based Russian-English transformer designed to compete with GPT-5 on Russian NLP tasks and multilingual understanding."
}
